Revit 2027 API
FileExportingEventArgs.BackgroundOperation Property
 Identifies whether the event belongs to a background export operation.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool BackgroundOperation { get; }
Public ReadOnly Property BackgroundOperation As Boolean
	Get
public:
property bool BackgroundOperation {
	bool get ();
}
member BackgroundOperation : bool with get
Property Value
Boolean
See Also
Reference
FileExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace